# TITLE

# Indian Companies Initial Startup Capital Analysis

# PROJECT DESCRIPTION


# Team niece has been tasked to set out to understand the problem, the indian start up terrain and how best a new business will attract rom investors and propose working course of action.

# HYPOTHESIS

# Null Hypothesis, HO
# There are no exact key factors that correlate with the exact amount of funding contributed by the investors.

# AlternativeHypothesis, H1
# There are exact key factors that correlate with the exact amount of funding contributed by investors.

# QUESTIONS

# Which year has the most funding?
# Which industry has the most funding?
# Which industry is fastest growing in funding?
# Which area has the most funding in India?
# What is the average funding per year?

# Data Cleaning

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

In [2]:
#loading our data
sheet1=pd.read_csv("startup_funding2018.csv")
sheet2=pd.read_csv("startup_funding2019.csv")
sheet3=pd.read_csv("startup_funding2020.csv")
sheet4=pd.read_csv("startup_funding2021.csv")

In [3]:
#checking the shape of each file
print(sheet1.shape,sheet2.shape,sheet3.shape,sheet4.shape)

(526, 6) (89, 9) (1055, 10) (1209, 9)

In [4]:
sheet1.head(2)

,Company Name,Industry,Round/Series,Amount,Location,About Company
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",A startup which aggregates milk from dairy far...

In [5]:
sheet2.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C

In [6]:
sheet3.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage,Unnamed: 9
0,Aqgromalin,2019,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,"$200,000",NaN,NaN
1,Krayonnz,2019,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,"$100,000",Pre-seed,NaN

In [7]:
sheet4.head(2)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",NaN

In [8]:
#changing column names
sheet1.rename(columns = {'Company Name':'Company/Brand', 'Industry':'Sector',
                              'Round/Series':'Stage', 'Amount':'Amount($)',
                        'Location':'HeadQuarter'}, inplace = True)

In [9]:
#delete unnecessary columns
sheet1.drop(columns=['About Company'], axis=1, inplace = True)
sheet2.drop(columns=['What it does', 'Investor', 'Founders'], axis=1, inplace = True)
sheet3.drop(columns=['What it does', 'Investor', 'Founders', 'Unnamed: 9'], axis=1, inplace = True)
sheet4.drop(columns=['What it does', 'Investor', 'Founders'], axis=1, inplace = True)

In [10]:
print(sheet1.shape,sheet2.shape,sheet3.shape,sheet4.shape)

(526, 5) (89, 6) (1055, 6) (1209, 6)

In [11]:
sheet1.head(120)

,Company/Brand,Sector,Stage,Amount($),HeadQuarter
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India"
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India"
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India"
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India"
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India"
...,...,...,...,...,...
115,Satin Creditcare Network Limited (SCNL),"Banking, Finance, Financial Services, Non Profit",Post-IPO Debt,"$30,000,000","New Delhi, Delhi, India"
116,APAC Financial Services,"Finance, Financial Services",Private Equity,"₹2,500,000,000","Mumbai, Maharashtra, India"
117,Moglix,"B2B, E-Commerce, Mobile",Series C,"$23,000,000","Noida, Uttar Pradesh, India"
118,SEDEMAC Mechatronics,"Automotive, Electric Vehicle, Renewable Energy",Venture - Series Unknown,—,"Mumbai, Maharashtra, India"
119,MadGuy Labs,E-Learning,Venture - Series Unknown,"$150,000","Hyderabad, Andhra Pradesh, India"

In [12]:
sheet2.head()

,Company/Brand,Founded,HeadQuarter,Sector,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,"$150,000,000",Series C
2,Eduisfun,NaN,Mumbai,Edtech,"$28,000,000",Fresh funding
3,HomeLane,2014.0,Chennai,Interior design,"$30,000,000",Series D
4,Nu Genes,2004.0,Telangana,AgriTech,"$6,000,000",NaN

In [13]:
sheet3.head()

  Company/Brand Founded HeadQuarter              Sector    Amount($)     Stage
0    Aqgromalin    2019     Chennai            AgriTech     $200,000       NaN
1      Krayonnz    2019   Bangalore              EdTech     $100,000  Pre-seed
2  PadCare Labs    2018        Pune  Hygiene management  Undisclosed  Pre-seed
3         NCOME    2020   New Delhi              Escrow     $400,000       NaN
4    Gramophone    2016      Indore            AgriTech     $340,000       NaN

In [14]:
sheet4.head()

,Company/Brand,Founded,HeadQuarter,Sector,Amount($),Stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,"$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,"$120,000,000",NaN
2,Lead School,2012.0,Mumbai,EdTech,"$30,000,000",Series D
3,Bizongo,2015.0,Mumbai,B2B E-commerce,"$51,000,000",Series C
4,FypMoney,2021.0,Gurugram,FinTech,"$2,000,000",Seed

In [15]:
#calculating the amount column for 2018
sheet1['Amount($)'] = sheet1['Amount($)']. apply(lambda x: str(x).replace('—','NaN'))
#sheet1['Amount($)'] = sheet1['Amount($)']. apply(lambda x: str(x).replace('₹',''))
#sheet1['Amount($)'] = sheet1['Amount($)']. apply(lambda x: str(x).replace('$',''))
#sheet1['Amount($)'] = sheet1['Amount($)']. apply(lambda x: str(x).replace(',',''))